mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xh/s6e2c1xh.svd
        <!-- REGISTER "FICLR" -->
        <register>
          <name>FICLR</name>
          <description>Flash Interrupt Clear Register [BHW]</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERRIC" -->
            <field>
              <name>ERRIC</name>
              <description>Flash ECC Error Interrupt Clear</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HNGIC" -->
            <field>
              <name>HNGIC</name>
              <description>Flash HANG Interrupt Clear</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYIC" -->
            <field>
              <name>RDYIC</name>
              <description>Flash RDY Interrupt Clear</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DFCTRLR" -->
        <register>
          <name>DFCTRLR</name>
          <description>Dual Flash mode Control Register [W]</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WKEY" -->
            <field>
              <name>WKEY</name>
              <description>Write Key</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RME" -->
            <field>
              <name>RME</name>
              <description>Re-Map Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DFE" -->
            <field>
              <name>DFE</name>
              <description>Dual Flash mode Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRTRMM" -->
        <register>
          <name>CRTRMM</name>
          <description>CR Trimming Data Mirror Register [BHW]</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TTRMM" -->
            <field>
              <name>TTRMM</name>
              <description>Temperature CR Trimming Data Mirror</description>
              <msb>20</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRMM" -->
            <field>
              <name>TRMM</name>
              <description>CR Trimming Data Mirror</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FGPDM1" -->
        <register>
          <name>FGPDM1</name>
          <description>Flash General Purpose Data Mirror Register1 [BHW]</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPD1" -->
            <field>
              <name>GPD1</name>
              <description>General Purpose Data1</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FGPDM2" -->
        <register>
          <name>FGPDM2</name>
          <description>Flash General Purpose Data Mirror Register2 [BHW]</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPD2" -->
            <field>
              <name>GPD2</name>
              <description>General Purpose Data2</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FGPDM3" -->
        <register>
          <name>FGPDM3</name>
          <description>Flash General Purpose Data Mirror Register3 [BHW]</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPD3" -->
            <field>
              <name>GPD3</name>
              <description>General Purpose Data3</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FGPDM4" -->
        <register>
          <name>FGPDM4</name>
          <description>Flash General Purpose Data Mirror Register4 [BHW]</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GPD4" -->
            <field>
              <name>GPD4</name>
              <description>General Purpose Data4</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
