mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xh/s6e2c1xh.svd
        <!-- REGISTER "OCU_OCSE3" -->
        <register derivedFrom="OCU_OCSE1">
          <name>OCU_OCSE3</name>
          <description>OCU ch.3 Control Register E [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x134</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSE4" -->
        <register derivedFrom="OCU_OCSE0">
          <name>OCU_OCSE4</name>
          <description>OCU ch.4 Control Register E [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x138</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSE5" -->
        <register derivedFrom="OCU_OCSE1">
          <name>OCU_OCSE5</name>
          <description>OCU ch.5 Control Register E [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x13C</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCFS10" -->
        <register>
          <name>OCU_OCFS10</name>
          <description>OCU ch.0/1 Connecting FRT Select Register [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x168</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSO1" -->
            <field>
              <name>FSO1</name>
              <description>Connects FRT ch.x to OCU ch.1</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSO0" -->
            <field>
              <name>FSO0</name>
              <description>Connects FRT ch.x to OCU ch.0</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCFS32" -->
        <register>
          <name>OCU_OCFS32</name>
          <description>OCU ch.2/3 Connecting FRT Select Register [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x169</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSO3" -->
            <field>
              <name>FSO3</name>
              <description>Connects FRT ch.x to OCU ch.3</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSO2" -->
            <field>
              <name>FSO2</name>
              <description>Connects FRT ch.x to OCU ch.2</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCFS54" -->
        <register>
          <name>OCU_OCFS54</name>
          <description>OCU ch.4/5 Connecting FRT Select Register [BHW]</description>
          <alternateGroup>OCU</alternateGroup>
          <addressOffset>0x16A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSO5" -->
            <field>
              <name>FSO5</name>
              <description>Connects FRT ch.x to OCU ch.5</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSO4" -->
            <field>
              <name>FSO4</name>
              <description>Connects FRT ch.x to OCU ch.4</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WFG_WFTF10" -->
        <register>
          <name>WFG_WFTF10</name>
          <description>Pulse Counter Value Register for WFG ch.0/1 [HW]</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x18E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTA10" -->
        <register>
          <name>WFG_WFTA10</name>
          <description>WFG Timer Value Register for WFG ch.0/1 [HW]</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x190</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTB10" -->
        <register>
          <name>WFG_WFTB10</name>
          <description>WFG Timer Value Register for WFG ch.0/1 [HW]</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x192</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTF32" -->
        <register>
          <name>WFG_WFTF32</name>
          <description>Pulse Counter Value Register for WFG ch.2/3 [HW]</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x196</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTA32" -->
        <register>
          <name>WFG_WFTA32</name>
          <description>WFG Timer Value Register for WFG ch.2/3 [HW]</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x198</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTB32" -->
        <register>
          <name>WFG_WFTB32</name>
          <description>WFG Timer Value Register for WFG ch.2/3 [HW]</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x19A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
