mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xh/s6e2c1xh.svd
        <!-- REGISTER "IRQ057MON" -->
        <register>
          <name>IRQ057MON</name>
          <description>IRQ057 Batch Read Register [BHW]</description>
          <addressOffset>0x2E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.14</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ058MON" -->
        <register>
          <name>IRQ058MON</name>
          <description>IRQ058 Batch Read Register [BHW]</description>
          <addressOffset>0x2EC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.15</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ059MON" -->
        <register>
          <name>IRQ059MON</name>
          <description>IRQ059 Batch Read Register [BHW]</description>
          <addressOffset>0x2F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPLLINT" -->
            <field>
              <name>IPLLINT</name>
              <description>PLL of I2S oscillation stabilization wait completion interrupt</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UPLLINT" -->
            <field>
              <name>UPLLINT</name>
              <description>PLL of USB / Ethernet oscillation stabilization wait completion interrupt</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MPLLINT" -->
            <field>
              <name>MPLLINT</name>
              <description>Main PLL oscillation stabilization wait completion interrupt</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SOSCINT" -->
            <field>
              <name>SOSCINT</name>
              <description>Sub clock oscillation stabilization wait completion interrupt</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MOSCINT" -->
            <field>
              <name>MOSCINT</name>
              <description>Main clock oscillation stabilization wait completion interrupt</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ060MON" -->
        <register>
          <name>IRQ060MON</name>
          <description>IRQ060 Batch Read Register [BHW]</description>
          <addressOffset>0x2F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT0_RX" -->
            <field>
              <name>MFSINT0_RX</name>
              <description>Reception interrupt request of the MFS ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ061MON" -->
        <register>
          <name>IRQ061MON</name>
          <description>IRQ061 Batch Read Register [BHW]</description>
          <addressOffset>0x2F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT0_STATUS" -->
            <field>
              <name>MFSINT0_STATUS</name>
              <description>Status interrupt request of the MFS ch.0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0_TX" -->
            <field>
              <name>MFSINT0_TX</name>
              <description>Transmission interrupt request of the MFS ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ062MON" -->
        <register>
          <name>IRQ062MON</name>
          <description>IRQ062 Batch Read Register [BHW]</description>
          <addressOffset>0x2FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1_RX" -->
            <field>
              <name>MFSINT1_RX</name>
              <description>Reception interrupt request of the MFS ch.1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ063MON" -->
        <register>
          <name>IRQ063MON</name>
          <description>IRQ063 Batch Read Register [BHW]</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1_STATUS" -->
            <field>
              <name>MFSINT1_STATUS</name>
              <description>Status interrupt request of the MFS ch.1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT1_TX" -->
            <field>
              <name>MFSINT1_TX</name>
              <description>Transmission interrupt request of the MFS ch.1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ064MON" -->
        <register>
          <name>IRQ064MON</name>
          <description>IRQ064 Batch Read Register [BHW]</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT2_RX" -->
            <field>
              <name>MFSINT2_RX</name>
              <description>Reception interrupt request of the MFS ch.2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ065MON" -->
        <register>
          <name>IRQ065MON</name>
          <description>IRQ065 Batch Read Register [BHW]</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT2_STATUS" -->
            <field>
              <name>MFSINT2_STATUS</name>
              <description>Status interrupt request of the MFS ch.2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT2_TX" -->
            <field>
              <name>MFSINT2_TX</name>
              <description>Transmission interrupt request of the MFS ch.2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
