mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xh/s6e2c1xh.svd
        <!-- REGISTER "MCR1REG" -->
        <register>
          <name>MCR1REG</name>
          <description>Channel Control Register 1 [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "S0CH31" -->
            <field>
              <name>S0CH31</name>
              <description>This controls the enable/disable state of the channel 31 in subframe 0</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH30" -->
            <field>
              <name>S0CH30</name>
              <description>This controls the enable/disable state of the channel 30 in subframe 0</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH29" -->
            <field>
              <name>S0CH29</name>
              <description>This controls the enable/disable state of the channel 29 in subframe 0</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH28" -->
            <field>
              <name>S0CH28</name>
              <description>This controls the enable/disable state of the channel 28 in subframe 0</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH27" -->
            <field>
              <name>S0CH27</name>
              <description>This controls the enable/disable state of the channel 27 in subframe 0</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH26" -->
            <field>
              <name>S0CH26</name>
              <description>This controls the enable/disable state of the channel 26 in subframe 0</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH25" -->
            <field>
              <name>S0CH25</name>
              <description>This controls the enable/disable state of the channel 25 in subframe 0</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH24" -->
            <field>
              <name>S0CH24</name>
              <description>This controls the enable/disable state of the channel 24 in subframe 0</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH23" -->
            <field>
              <name>S0CH23</name>
              <description>This controls the enable/disable state of the channel 23 in subframe 0</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH22" -->
            <field>
              <name>S0CH22</name>
              <description>This controls the enable/disable state of the channel 22 in subframe 0</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH21" -->
            <field>
              <name>S0CH21</name>
              <description>This controls the enable/disable state of the channel 21 in subframe 0</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH20" -->
            <field>
              <name>S0CH20</name>
              <description>This controls the enable/disable state of the channel 20 in subframe 0</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH19" -->
            <field>
              <name>S0CH19</name>
              <description>This controls the enable/disable state of the channel 19 in subframe 0</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH18" -->
            <field>
              <name>S0CH18</name>
              <description>This controls the enable/disable state of the channel 18 in subframe 0</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH17" -->
            <field>
              <name>S0CH17</name>
              <description>This controls the enable/disable state of the channel 17 in subframe 0</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH16" -->
            <field>
              <name>S0CH16</name>
              <description>This controls the enable/disable state of the channel 16 in subframe 0</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH15" -->
            <field>
              <name>S0CH15</name>
              <description>This controls the enable/disable state of the channel 15 in subframe 0</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH14" -->
            <field>
              <name>S0CH14</name>
              <description>This controls the enable/disable state of the channel 14 in subframe 0</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH13" -->
            <field>
              <name>S0CH13</name>
              <description>This controls the enable/disable state of the channel 13 in subframe 0</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH12" -->
            <field>
              <name>S0CH12</name>
              <description>This controls the enable/disable state of the channel 12 in subframe 0</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH11" -->
            <field>
              <name>S0CH11</name>
              <description>This controls the enable/disable state of the channel 11 in subframe 0</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH10" -->
            <field>
              <name>S0CH10</name>
              <description>This controls the enable/disable state of the channel 10 in subframe 0</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH09" -->
            <field>
              <name>S0CH09</name>
              <description>This controls the enable/disable state of the channel 9 in subframe 0</description>
              <msb>09</msb>
              <lsb>09</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH08" -->
            <field>
              <name>S0CH08</name>
              <description>This controls the enable/disable state of the channel 8 in subframe 0</description>
              <msb>08</msb>
              <lsb>08</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH07" -->
            <field>
              <name>S0CH07</name>
              <description>This controls the enable/disable state of the channel 7 in subframe 0</description>
              <msb>07</msb>
              <lsb>07</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH06" -->
            <field>
              <name>S0CH06</name>
              <description>This controls the enable/disable state of the channel 6 in subframe 0</description>
              <msb>06</msb>
              <lsb>06</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH05" -->
            <field>
              <name>S0CH05</name>
              <description>This controls the enable/disable state of the channel 5 in subframe 0</description>
              <msb>05</msb>
              <lsb>05</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH04" -->
            <field>
              <name>S0CH04</name>
              <description>This controls the enable/disable state of the channel 4 in subframe 0</description>
              <msb>04</msb>
              <lsb>04</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH03" -->
            <field>
              <name>S0CH03</name>
              <description>This controls the enable/disable state of the channel 3 in subframe 0</description>
              <msb>03</msb>
              <lsb>03</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH02" -->
            <field>
              <name>S0CH02</name>
              <description>This controls the enable/disable state of the channel 2 in subframe 0</description>
              <msb>02</msb>
              <lsb>02</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH01" -->
            <field>
              <name>S0CH01</name>
              <description>This controls the enable/disable state of the channel 1 in subframe 0</description>
              <msb>01</msb>
              <lsb>01</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH00" -->
            <field>
              <name>S0CH00</name>
              <description>This controls the enable/disable state of the channel 0 in subframe 0</description>
              <msb>00</msb>
              <lsb>00</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCR2REG" -->
        <register>
          <name>MCR2REG</name>
          <description>Channel Control Register 2 [BHW]</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "S1CH31" -->
            <field>
              <name>S1CH31</name>
              <description>This controls the enable/disable state of the channel 31 in subframe 1</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH30" -->
            <field>
              <name>S1CH30</name>
              <description>This controls the enable/disable state of the channel 30 in subframe 1</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH29" -->
            <field>
              <name>S1CH29</name>
              <description>This controls the enable/disable state of the channel 29 in subframe 1</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH28" -->
            <field>
              <name>S1CH28</name>
              <description>This controls the enable/disable state of the channel 28 in subframe 1</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH27" -->
            <field>
              <name>S1CH27</name>
              <description>This controls the enable/disable state of the channel 27 in subframe 1</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH26" -->
            <field>
              <name>S1CH26</name>
              <description>This controls the enable/disable state of the channel 26 in subframe 1</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH25" -->
            <field>
              <name>S1CH25</name>
              <description>This controls the enable/disable state of the channel 25 in subframe 1</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH24" -->
            <field>
              <name>S1CH24</name>
              <description>This controls the enable/disable state of the channel 24 in subframe 1</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH23" -->
            <field>
              <name>S1CH23</name>
              <description>This controls the enable/disable state of the channel 23 in subframe 1</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH22" -->
            <field>
              <name>S1CH22</name>
              <description>This controls the enable/disable state of the channel 22 in subframe 1</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH21" -->
            <field>
              <name>S1CH21</name>
              <description>This controls the enable/disable state of the channel 21 in subframe 1</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH20" -->
            <field>
              <name>S1CH20</name>
              <description>This controls the enable/disable state of the channel 20 in subframe 1</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH19" -->
            <field>
              <name>S1CH19</name>
              <description>This controls the enable/disable state of the channel 19 in subframe 1</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH18" -->
            <field>
              <name>S1CH18</name>
              <description>This controls the enable/disable state of the channel 18 in subframe 1</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH17" -->
            <field>
              <name>S1CH17</name>
              <description>This controls the enable/disable state of the channel 17 in subframe 1</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH16" -->
            <field>
              <name>S1CH16</name>
              <description>This controls the enable/disable state of the channel 16 in subframe 1</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH15" -->
            <field>
              <name>S1CH15</name>
              <description>This controls the enable/disable state of the channel 15 in subframe 1</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH14" -->
            <field>
              <name>S1CH14</name>
              <description>This controls the enable/disable state of the channel 14 in subframe 1</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH13" -->
            <field>
              <name>S1CH13</name>
              <description>This controls the enable/disable state of the channel 13 in subframe 1</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH12" -->
            <field>
              <name>S1CH12</name>
              <description>This controls the enable/disable state of the channel 12 in subframe 1</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH11" -->
            <field>
              <name>S1CH11</name>
              <description>This controls the enable/disable state of the channel 11 in subframe 1</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH10" -->
            <field>
              <name>S1CH10</name>
              <description>This controls the enable/disable state of the channel 10 in subframe 1</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH09" -->
            <field>
              <name>S1CH09</name>
              <description>This controls the enable/disable state of the channel 9 in subframe 1</description>
              <msb>09</msb>
              <lsb>09</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH08" -->
            <field>
              <name>S1CH08</name>
              <description>This controls the enable/disable state of the channel 8 in subframe 1</description>
              <msb>08</msb>
              <lsb>08</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH07" -->
            <field>
              <name>S1CH07</name>
              <description>This controls the enable/disable state of the channel 7 in subframe 1</description>
              <msb>07</msb>
              <lsb>07</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH06" -->
            <field>
              <name>S1CH06</name>
              <description>This controls the enable/disable state of the channel 6 in subframe 1</description>
              <msb>06</msb>
              <lsb>06</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH05" -->
            <field>
              <name>S1CH05</name>
              <description>This controls the enable/disable state of the channel 5 in subframe 1</description>
              <msb>05</msb>
              <lsb>05</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH04" -->
            <field>
              <name>S1CH04</name>
              <description>This controls the enable/disable state of the channel 4 in subframe 1</description>
              <msb>04</msb>
              <lsb>04</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH03" -->
            <field>
              <name>S1CH03</name>
              <description>This controls the enable/disable state of the channel 3 in subframe 1</description>
              <msb>03</msb>
              <lsb>03</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH02" -->
            <field>
              <name>S1CH02</name>
              <description>This controls the enable/disable state of the channel 2 in subframe 1</description>
              <msb>02</msb>
              <lsb>02</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH01" -->
            <field>
              <name>S1CH01</name>
              <description>This controls the enable/disable state of the channel 1 in subframe 1</description>
              <msb>01</msb>
              <lsb>01</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH00" -->
            <field>
              <name>S1CH00</name>
              <description>This controls the enable/disable state of the channel 0 in subframe 1</description>
              <msb>00</msb>
              <lsb>00</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OPRREG" -->
        <register>
          <name>OPRREG</name>
          <description>Operation Control Register [BHW]</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01010001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RXENB" -->
            <field>
              <name>RXENB</name>
              <description>This sets the enabled/disabled state of the receive operation</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXENB" -->
            <field>
              <name>TXENB</name>
              <description>This sets the enabled/disabled state of the transmit operation</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "START" -->
            <field>
              <name>START</name>
              <description>This enables or disables the I2S interface</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
