mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xh/s6e2c1xh.svd
        <!-- REGISTER "SPRVAL5" -->
        <register>
          <name>SPRVAL5</name>
          <description>Preset Value Register for SDR50 [BHW]</description>
          <addressOffset>0x6A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xC7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSSELVAL" -->
            <field>
              <name>DSSELVAL</name>
              <description>Driver Strength Select Value</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CGSELVAL" -->
            <field>
              <name>CGSELVAL</name>
              <description>Clock Generator Select Value</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCFSELVAL" -->
            <field>
              <name>SCFSELVAL</name>
              <description>SDCLK Frequency Select Value</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SPRVAL6" -->
        <register>
          <name>SPRVAL6</name>
          <description>Preset Value Register for SDR104 [BHW]</description>
          <addressOffset>0x6C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xC7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSSELVAL" -->
            <field>
              <name>DSSELVAL</name>
              <description>Driver Strength Select Value</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CGSELVAL" -->
            <field>
              <name>CGSELVAL</name>
              <description>Clock Generator Select Value</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCFSELVAL" -->
            <field>
              <name>SCFSELVAL</name>
              <description>SDCLK Frequency Select Value</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SPRVAL7" -->
        <register>
          <name>SPRVAL7</name>
          <description>Preset Value Register for DDR50 [BHW]</description>
          <addressOffset>0x6E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xC7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSSELVAL" -->
            <field>
              <name>DSSELVAL</name>
              <description>Driver Strength Select Value</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CGSELVAL" -->
            <field>
              <name>CGSELVAL</name>
              <description>Clock Generator Select Value</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCFSELVAL" -->
            <field>
              <name>SCFSELVAL</name>
              <description>SDCLK Frequency Select Value</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SSHBCTLL" -->
        <register>
          <name>SSHBCTLL</name>
          <description>Shared Bus Control Register L [BHW]</description>
          <addressOffset>0xE0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x7F37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BUSWDPRST" -->
            <field>
              <name>BUSWDPRST</name>
              <description>Bus Width Preset</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTINPIN" -->
            <field>
              <name>INTINPIN</name>
              <description>Number of Interrupt Input Pins</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLCKPIN" -->
            <field>
              <name>CLCKPIN</name>
              <description>Number of Clock Pins</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SSHBCTLH" -->
        <register>
          <name>SSHBCTLH</name>
          <description>Shared Bus Control Register H [BHW]</description>
          <addressOffset>0xE2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x7F77</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BEPWRCTL" -->
            <field>
              <name>BEPWRCTL</name>
              <description>Back-End Power Control</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTPINSEL" -->
            <field>
              <name>INTPINSEL</name>
              <description>Interrupt Pin Select</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLCKPINSEL" -->
            <field>
              <name>CLCKPINSEL</name>
              <description>Clock Pin Select</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SSLIST" -->
        <register>
          <name>SSLIST</name>
          <description>Slot Interrupt Status Register [BHW]</description>
          <addressOffset>0xFC</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SLOTINTSGN" -->
            <field>
              <name>SLOTINTSGN</name>
              <description>Interrupt Signal For Each Slot</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SHCTLV" -->
        <register>
          <name>SHCTLV</name>
          <description>Host Controller Version Register [BHW]</description>
          <addressOffset>0xFE</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0102</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VNDVERNUM" -->
            <field>
              <name>VNDVERNUM</name>
              <description>Vendor Version Number</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SPECVERNUM" -->
            <field>
              <name>SPECVERNUM</name>
              <description>Specification Version Number</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AHBCFGL" -->
        <register>
          <name>AHBCFGL</name>
          <description>AHB Config Register L [BHW]</description>
          <addressOffset>0x100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ENDIANSEL" -->
            <field>
              <name>ENDIANSEL</name>
              <description>Big/Little Endian Select</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BSLOCKSEL" -->
            <field>
              <name>BSLOCKSEL</name>
              <description>Bus Lock Select</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BSLOCK" -->
            <field>
              <name>BSLOCK</name>
              <description>Bus Lock Function</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SINEN" -->
            <field>
              <name>SINEN</name>
              <description>Burst type for byte transfer Select</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INCRSEL" -->
            <field>
              <name>INCRSEL</name>
              <description>AHB fixed length burst type Select</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AHBCFGH" -->
        <register>
          <name>AHBCFGH</name>
          <description>AHB Config Registe H [BHW]</description>
          <addressOffset>0x102</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "SPWSWCL" -->
        <register>
          <name>SPWSWCL</name>
          <description>Power Switching Register L [BHW]</description>
          <addressOffset>0x104</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IOREGSEL" -->
            <field>
              <name>IOREGSEL</name>
              <description>I/O Register Selecting</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ATPWRSWEN" -->
            <field>
              <name>ATPWRSWEN</name>
              <description>Auto Power Switching Select</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SPWSWCH" -->
        <register>
          <name>SPWSWCH</name>
          <description>Power Switching Register H [BHW]</description>
          <addressOffset>0x106</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "STUNSETL" -->
        <register>
          <name>STUNSETL</name>
          <description>Tuning Setting Register L [BHW]</description>
          <addressOffset>0x108</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x1FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RETNRNGSEL" -->
            <field>
              <name>RETNRNGSEL</name>
              <description>Re-Tuning Range Select</description>
              <msb>12</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RETNTAPSEL" -->
            <field>
              <name>RETNTAPSEL</name>
              <description>Re-Tuning Tap Select</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TNERRBDSEL" -->
            <field>
              <name>TNERRBDSEL</name>
              <description>Tuning Error Border Select</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TNPHSELEN" -->
            <field>
              <name>TNPHSELEN</name>
              <description>Tuning Phase Select Enable</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TNPTSEL" -->
            <field>
              <name>TNPTSEL</name>
              <description>Tuning Point Select</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STUNSETH" -->
        <register>
          <name>STUNSETH</name>
          <description>Tuning Setting Register H [BHW]</description>
          <addressOffset>0x10A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0F01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DTOTCNTVAL" -->
            <field>
              <name>DTOTCNTVAL</name>
              <description>Data Timeout Counter Value For Auto Re-Tuning</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMDCFCHKDS" -->
            <field>
              <name>CMDCFCHKDS</name>
              <description>CMD Conflict Check Disable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
