mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c1xh/s6e2c1xh.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "HSSPI" -->
    <peripheral>
      <name>HSSPI</name>
      <description>HI-SPEED SPI Controller</description>
      <version>A</version>
      <groupName>HSSPI</groupName>
      <baseAddress>0xD0000000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x36</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0xB4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x400</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x404</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "HSSPI" -->
      <interrupt>
        <name>HSSPI</name>
        <value>115</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "MCTRL" -->
        <register>
          <name>MCTRL</name>
          <description>Control Register [BHW]</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000033</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SYNCON" -->
            <field>
              <name>SYNCON</name>
              <description>Synchronizer circuit operation bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MES" -->
            <field>
              <name>MES</name>
              <description>Module enable status bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CSEN" -->
            <field>
              <name>CSEN</name>
              <description>Command sequencer mode enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MEN" -->
            <field>
              <name>MEN</name>
              <description>Module enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCC0" -->
        <register>
          <name>PCC0</name>
          <description>Peripheral Communication Setting Register 0 [BHW]</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x007F0000</resetValue>
          <resetMask>0x007FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RDDSEL" -->
            <field>
              <name>RDDSEL</name>
              <description>Read deselect time setting bits</description>
              <msb>22</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WRDSEL" -->
            <field>
              <name>WRDSEL</name>
              <description>Write or different command deselect time setting bits</description>
              <msb>20</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SAFESYNC" -->
            <field>
              <name>SAFESYNC</name>
              <description>Safe synchronization bit</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CDRS" -->
            <field>
              <name>CDRS</name>
              <description>Clock division ratio setting bits</description>
              <msb>15</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SENDIAN" -->
            <field>
              <name>SENDIAN</name>
              <description>Endian setting bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDIR" -->
            <field>
              <name>SDIR</name>
              <description>Shift direction setting bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SS2CD" -->
            <field>
              <name>SS2CD</name>
              <description>Slave-select-to-clock-start delay time setting bit</description>
              <msb>6</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SSPOL" -->
            <field>
              <name>SSPOL</name>
              <description>Slave select polarity setting bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTM" -->
            <field>
              <name>RTM</name>
              <description>Timing compensation setting bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACES" -->
            <field>
              <name>ACES</name>
              <description>Serial data transmission/reception timing setting bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CPOL" -->
            <field>
              <name>CPOL</name>
              <description>Serial clock polarity setting bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CPHA" -->
            <field>
              <name>CPHA</name>
              <description>Clock phase setting bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCC1" -->
        <register derivedFrom="PCC0">
          <name>PCC1</name>
          <description>Peripheral Communication Setting Registers 1 [BHW]</description>
          <addressOffset>0x08</addressOffset>
        </register>
        <!-- REGISTER "PCC2" -->
        <register derivedFrom="PCC0">
          <name>PCC2</name>
          <description>Peripheral Communication Setting Registers 2 [BHW]</description>
          <addressOffset>0x0C</addressOffset>
        </register>
